alperbasarn/homio-round-hmi/esp-idf/sdkconfig.defaults.esp32s3
# ESP32-S3 Base Configuration
# Shared target defaults for Waveshare ESP32-S3 display boards

CONFIG_IDF_TARGET="esp32s3"

# CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Flash settings
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# USB Console (ESP32-S3 has USB)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# OTA (allow HTTP updates for local testing)
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y
CONFIG_OTA_ALLOW_HTTP=y
